Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/РасчетБазыНачисленийУдержаний/РасчетБазыНачисленийУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетБазыНачисленийУдержаний</name>
</mdclass:DataProcessor>

Комплексная_автоматизация_2_МОМ_2019/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатВТомЧислеЗаСчетФБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РанееНачислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВЧасах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВЦеломЗаПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыНорма</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксСтрока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксРасчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксСторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяБазаЗаЕдиницуНормыВремени</name>
    <comment>Расчетная база на единицу нормы времени для расчета сторно-записей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрацииВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрацииНормыВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <comment>Документ, который зарегистрировал сторнируемое начисление</comment>
    <type>
      <types>DefinedType.СторнируемыйДокумент</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийГрафик</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Перерасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьПоРазовымНачислениямДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистраторРазовогоНачисления</name>
    <type>
      <types>DefinedType.РегистраторРазовогоНачисления</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СторноТекущегоПериода</name>
    <type>
      <types>DefinedType.ДокументИсправляемыйВТекущемПериоде</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйАгент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксСторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВзыскания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/РасчетБазыНачисленийУдержаний/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйНастройкиРасчетаБазыНачислений() Экспорт
	НастройкиРасчетаБазы = Новый Структура;
	НастройкиРасчетаБазы.Вставить("РасчетПоДаннымТекущегоНабора", Ложь);
	НастройкиРасчетаБазы.Вставить("ИсключаемыйРегистратор", Неопределено);
	НастройкиРасчетаБазы.Вставить("ПолучатьПодробнуюРасшифровку", Ложь);
	
	Возврат НастройкиРасчетаБазы;
КонецФункции	

Функция НовыйНастройкиРасчетаБазыУдержаний() Экспорт
	НастройкиРасчетаБазы = Новый Структура;
	НастройкиРасчетаБазы.Вставить("РасчетПоДаннымТекущегоНабора", Ложь);
	НастройкиРасчетаБазы.Вставить("ИсключаемыйРегистратор", Неопределено);	
	
	Возврат НастройкиРасчетаБазы;
КонецФункции	
	
Функция НовыйОписаниеРассчитываемогоНабораВременнаяТаблица() Экспорт
	ОписаниеРассчитываемогоНабора = Новый Структура();
	ОписаниеРассчитываемогоНабора.Вставить("Тип", Тип("МенеджерВременныхТаблиц"));
	ОписаниеРассчитываемогоНабора.Вставить("ИмяВТРассчитываемыеЗаписи", "");
	ОписаниеРассчитываемогоНабора.Вставить("МенеджерВременныхТаблиц");
	
	Возврат ОписаниеРассчитываемогоНабора;
КонецФункции	

Функция НовыйОписаниеРассчитываемогоНабораНачисленийТаблица() Экспорт
	ОписаниеРассчитываемогоНабора = Новый Структура();
	
	РассчитываемыеЗаписи = Новый ТаблицаЗначений();
	РассчитываемыеЗаписи.Колонки.Добавить("Регистратор", РегистрыРасчета.Начисления.ОписаниеТиповПоляРегистратор());
	РассчитываемыеЗаписи.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	РассчитываемыеЗаписи.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	РассчитываемыеЗаписи.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
	РассчитываемыеЗаписи.Колонки.Добавить("ПериодРегистрации", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("БазовыйПериодНачало", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("БазовыйПериодКонец", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	РассчитываемыеЗаписи.Колонки.Добавить("СторнируемыйДокумент", РегистрыРасчета.Начисления.ОписаниеТиповПоляРегистратор());
	РассчитываемыеЗаписи.Колонки.Добавить("РассчитыватьПоРазовымНачислениямДокумента", Новый ОписаниеТипов("Булево"));
	РассчитываемыеЗаписи.Колонки.Добавить("РегистраторРазовогоНачисления", Метаданные.ОпределяемыеТипы.РегистраторРазовогоНачисления.Тип);
	
	ОписаниеРассчитываемогоНабора.Вставить("Тип", Тип("ТаблицаЗначений"));
	ОписаниеРассчитываемогоНабора.Вставить("РассчитываемыеЗаписи", РассчитываемыеЗаписи);
	
	Возврат ОписаниеРассчитываемогоНабора;
КонецФункции

Функция НовыйОписаниеРассчитываемогоНабораУдержанийТаблица() Экспорт
	ОписаниеРассчитываемогоНабора = Новый Структура();
	
	РассчитываемыеЗаписи = Новый ТаблицаЗначений();
	РассчитываемыеЗаписи.Колонки.Добавить("Регистратор", РегистрыРасчета.Удержания.ОписаниеТиповПоляРегистратор());
	РассчитываемыеЗаписи.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	РассчитываемыеЗаписи.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	РассчитываемыеЗаписи.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РассчитываемыеЗаписи.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	РассчитываемыеЗаписи.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Удержания"));
	РассчитываемыеЗаписи.Колонки.Добавить("МесяцУдержания", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("БазовыйПериодНачало", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("БазовыйПериодКонец", Новый ОписаниеТипов("Дата"));
	РассчитываемыеЗаписи.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	РассчитываемыеЗаписи.Колонки.Добавить("СторнируемыйДокумент", РегистрыРасчета.Начисления.ОписаниеТиповПоляРегистратор());
	РассчитываемыеЗаписи.Колонки.Добавить("РассчитыватьПоРазовымНачислениямДокумента", Новый ОписаниеТипов("Булево"));
	РассчитываемыеЗаписи.Колонки.Добавить("РегистраторРазовогоНачисления", Метаданные.ОпределяемыеТипы.РегистраторРазовогоНачисления.Тип);
		
	ОписаниеРассчитываемогоНабора.Вставить("Тип", Тип("ТаблицаЗначений"));
	ОписаниеРассчитываемогоНабора.Вставить("РассчитываемыеЗаписи", РассчитываемыеЗаписи);
	
	Возврат ОписаниеРассчитываемогоНабора;
КонецФункции

#КонецОбласти

#КонецЕсли
